
<!-- header -->
```fish
plan -chdir=sample/bucket -workspace=qa -backend-config=backend/qa.tfbackend -lock=false
```
<!-- fmt -->
<details><summary>Format diff check.</summary>

```diff
[command]/home/runner/work/_temp/8fb25620-e6af-4384-a88b-05b9f1eef429/tofu-bin -chdir=sample/bucket fmt -list=false -write=false -diff=true -recursive=true
::debug::OpenTofu exited with code 0.
::debug::stdout: 
::debug::stderr: 
::debug::exitcode: 0

```
</details>
<!-- outline -->
<details><summary>Outline of changes.</summary>

```diff
+ module.sample_bucket.module.s3_bucket.aws_s3_bucket.this[0] will be created
+ module.sample_bucket.module.s3_bucket.aws_s3_bucket_acl.this[0] will be created
+ module.sample_bucket.module.s3_bucket.aws_s3_bucket_ownership_controls.this[0] will be created
+ module.sample_bucket.module.s3_bucket.aws_s3_bucket_public_access_block.this[0] will be created
+ module.sample_bucket.module.s3_bucket.aws_s3_bucket_versioning.this[0] will be created
```
</details>
<!-- main -->
<details><summary>Plan: 5 to add, 0 to change, 0 to destroy.</br>

###### TF Sample by @RDhar via [pull_request](https://github.com/DevSecTop/TF-via-PR/actions/runs/10181079448/job/28160370610) at 2024-07-31T13:22:04Z.
</summary>

```hcl
[command]/home/runner/work/_temp/8fb25620-e6af-4384-a88b-05b9f1eef429/tofu-bin -chdir=sample/bucket plan -out=tfplan -lock=false

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # module.sample_bucket.module.s3_bucket.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "sample-bucket"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = false
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Environment" = "Quality Assurance"
          + "Stack"       = "bucket"
          + "Terraform"   = "qa"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.sample_bucket.module.s3_bucket.aws_s3_bucket_acl.this[0] will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # module.sample_bucket.module.s3_bucket.aws_s3_bucket_ownership_controls.this[0] will be created
  + resource "aws_s3_bucket_ownership_controls" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # module.sample_bucket.module.s3_bucket.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.sample_bucket.module.s3_bucket.aws_s3_bucket_versioning.this[0] will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + sample_bucket_id = (known after apply)
::debug::OpenTofu exited with code 0.
::debug::stderr: 
::debug::exitcode: 0

```
</details>
<!-- footer -->
<!-- 266--chdir-sample-bucket--workspace-qa--backend-config-backend-qa-tfbackend-tofu--out-tfplan -->